## Overview
- Client: Microsoft
- Business Questions: "Launch New Movie Studio? (for Original Video content) 
- Current Task: Understand Movie Industry
    1. Data analysis - "what type of films are currently doing the best at the box office?"
    2. **5 min presentation** - "what type of films they should be creating"
    
## Data Analysis    
- "what **type of films** are **currently** doing the **best at the box office**?"
    - Data Available
        - Data source (use >=2)
            - ( )Box Office Mojo
            - ( )IMDB
            - ( ) Rotten Tomatoes
            - ( )TheMovieDB.org
        -  Movie Features of interest (genres,ratings,budget, social media discussion,critic or user reviews)
    - Analysis Required 
        - ( ) 1 joined/cleaned dataset
        - ( ) 4 visualization 
        - ( ) 2 summary table
    - Qs to answer
        - ( ) type of movie to recommend? 
        - ( ) budget requirement? 
        - ( ) recuiting (cast, director...)?

### Libraries

In [5]:
# import libraries 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

### Data Set Expolre

In [7]:
!ls /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data

bom.movie_gross.csv.gz       imdb.title.ratings.csv.gz
imdb.name.basics.csv.gz      rt.movie_info.tsv.gz
imdb.title.akas.csv.gz       rt.reviews.tsv.gz
imdb.title.basics.csv.gz     tmdb.movies.csv.gz
imdb.title.crew.csv.gz       tn.movie_budgets.csv.gz
imdb.title.principals.csv.gz

#### Read in Datasets

- Box Office Mojo

In [6]:
#inspect data on command line without unzipping, 
# you can use gzip -cd <filename> | head 
# (I like to think -cd stands for Continuous Decompress).

#!gzip -cd /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/bom.movie_gross.csv.gz|head

In [9]:
bom = pd.read_csv('/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/bom.movie_gross.csv.gz')
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

- IMDB
    - tab-separated-values (TSV) formatted file in the UTF-8 character set

In [19]:
imdb_datasets = ['imdb.name.basics.csv.gz',
                'imdb.title.akas.csv.gz',
                'imdb.title.basics.csv.gz',
                'imdb.title.crew.csv.gz',
                'imdb.title.principals.csv.gz',
                'imdb.title.ratings.csv.gz']
url=[]
for dataset in imdb_datasets:
    url.append('/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/'+dataset)

In [20]:
imdb_name_basics = pd.read_csv(url[0])
imdb_title_akas = pd.read_csv(url[1])
imdb_title_basics = pd.read_csv(url[2])
imdb_title_crew = pd.read_csv(url[3])
imdb_title_principals = pd.read_csv(url[4])
imdb_title_ratings = pd.read_csv(url[5])

- Rottem Tomatoes

In [31]:
#!gzip -cd /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/rt.movie_info.tsv.gz|head

In [37]:
url_rt1 = '/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/rt.movie_info.tsv.gz'
rt_movie_info = pd.read_csv(url_rt1, sep = '\t')

In [39]:
url_rt2 = '/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/rt.reviews.tsv.gz'
rt_reviews=pd.read_csv(url_rt2, sep = '\t',  encoding='mac_roman')

- MovieDB

In [45]:
url_rt3 = '/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/tmdb.movies.csv.gz'
tmdb_movies = pd.read_csv(url_rt3)

In [48]:
url_rt4 = '/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/tn.movie_budgets.csv.gz'
tmdb_movie_budgets = pd.read_csv(url_rt4)

#### Box Office Mojo

In [61]:
bom.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

#### IMDb

In [60]:
imdb_name_basics.head(2)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

In [59]:
imdb_title_akas.head(2)

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0

In [58]:
imdb_title_basics.head(2)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [57]:
imdb_title_crew.head(2)

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

In [56]:
imdb_title_principals.head(2)

      tconst  ordering     nconst  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

In [27]:
imdb_title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

#### RT

In [55]:
rt_movie_info.head(2)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One

In [54]:
rt_reviews.head(2)

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"

#### TMDB

In [52]:
tmdb_movies.head(2)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

In [53]:
tmdb_movie_budgets.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

### Movies 
- All About Money ()
    - bom 
    - tmdb

In [66]:
bom.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [63]:
tmdb_movie_budgets.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [65]:
tmdb_movies.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [72]:
tmdb_movie_budgets['id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [71]:
tmdb_movies['id'].unique()

array([ 12444,  10191,  10138, ..., 381231, 366854, 309885])

In [67]:
bom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [68]:
tmdb_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

In [69]:
tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

### bom + tmdb + imdb

1. Limit tmdb data to 2010-2018 
    - parse to Y, m, d,(keep month, date)
2. join tables by movie title
    - check movie name difference in the tables

In [76]:
bom['year'].unique()

array([2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018])

1. Limit tmdb data to 2010-2018 
    - parse to Y, m, d,(keep month, date)

In [91]:
# check data format
tmdb_movie_budgets['release_date'].head()

0    Dec 18, 2009
1    May 20, 2011
2     Jun 7, 2019
3     May 1, 2015
4    Dec 15, 2017
Name: release_date, dtype: object

In [88]:
# get the year of tmdb_movie_budgets
tmdb_movie_budgets['year']=tmdb_movie_budgets['release_date'].apply(lambda x:int(x[-4:]))

In [101]:
# check 
tmdb_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,date,month
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,2011-05-20,5
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,2019-06-07,6
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,2015-05-01,5
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017,2017-12-15,12
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220",2015,2015-12-18,12

In [98]:
tmdb_movie_budgets['date'] = pd.to_datetime(tmdb_movie_budgets['release_date'])

In [100]:
tmdb_movie_budgets['month'] = tmdb_movie_budgets['date'].dt.month

In [95]:
# slicing dataset 2010-2019
mask = (tmdb_movie_budgets['year']<=2019) & (tmdb_movie_budgets['year']>=2010)
tmdb_movie_budgets = tmdb_movie_budgets.loc[mask].copy()

In [97]:
# tmdb_movies
tmdb_movies.head(2)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

In [90]:
tmdb_movies['release_date'].head()

0    2010-11-19
1    2010-03-26
2    2010-05-07
3    1995-11-22
4    2010-07-16
Name: release_date, dtype: object

In [102]:
tmdb_movies['date'] = pd.to_datetime(tmdb_movies['release_date'])

In [103]:
# add year & month to tmdb_movies
tmdb_movies['year'] = tmdb_movies['date'].dt.year
tmdb_movies['month']= tmdb_movies['date'].dt.month
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,date,year,month
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010-11-19,2010,11
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010-03-26,2010,3
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,2010-05-07,2010,5
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,1995-11-22,1995,11
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,2010-07-16,2010,7

In [104]:
# slice tmdb_movies (year 2010-2019)
mask = (tmdb_movies['year']<=2019) & (tmdb_movies['year']>=2010)
tmdb_movies = tmdb_movies.loc[mask].copy()